# import

In [4]:
import pandas as pd

# read excel

In [5]:
df = pd.read_excel('C:\\Users\\Mina\\Desktop\\Tasks\\Instant-AI-Tasks\\Tasks\\Task 16\\weather.xlsx')
df

       city  temprature  event  humidity
0     cairo          30  sunny         8
1      alex          25   rain         5
2     luxor          35  sunny        10
3  hurghada          29  sunny         4

# replace

In [9]:
df.replace({
    'event' : 'rain',
},'cloudy')

       city  temprature   event  humidity
0     cairo          30   sunny         8
1      alex          25  cloudy         5
2     luxor          35   sunny        10
3  hurghada          29   sunny         4

# write csv

In [10]:
df.to_csv('replace.csv',index=False)